Webahh/embedded_signlanguage_translator/STM32N6570DK_LL/STM32N6570DK/FSBL/Src/Drivers/Simple/Inc/simple_gpio.h
/*
 * simple_gpio.h
 *
 *  Created on: May 21, 2026
 *      Author: Weber
 */

#ifndef SIMPLE_GPIO_H
#define SIMPLE_GPIO_H

#include "stm32n657xx.h"

#define GPIO_MODE_INPUT 		0
#define GPIO_MODE_OUTPUT		1
#define GPIO_MODE_AF			2
#define GPIO_MODE_ANALOG		3

#define GPIO_OTYPE_PP			0
#define GPIO_OTYPE_OD			1

#define GPIO_PUPD_NONE			0
#define GPIO_PUPD_UP			1
#define GPIO_PUPD_DOWN			2

#define GPIO_SPEED_LOW        	0U
#define GPIO_SPEED_MEDIUM     	1U
#define GPIO_SPEED_HIGH       	2U
#define GPIO_SPEED_VERY_HIGH  	3U

#define GPIO_AF_NONE			-1
#define GPIO_I2C				4
#define LTDC_AF 				14
#define XSPI_AF 				9

void GPIO_Config(GPIO_TypeDef* GPIOX, int pinNr, int mode, int otyp, int pupdr, int af);
void GPIO_set_speed(GPIO_TypeDef* GPIOX, pinNr, int speed);
int GPIO_get(GPIO_TypeDef* GPIOX, int pinNr);
void GPIO_BSRR_set(GPIO_TypeDef* GPIOX, int pinNr);
void GPIO_BSRR_reset(GPIO_TypeDef* GPIOX, int pinNr);
void GPIO_BSRR_toggle(GPIO_TypeDef* GPIOX, int pinNr);

#endif // SIMPLE_GPIO_H
